import React from "react";

const HomeIntro = () => {
  return (
    <section className="max-w-4xl mx-auto p-6">
      <div className="max-w-4xl mx-auto">
        <h1 className="text-3xl font-semibold text-gray-800 mb-6 text-center sm:text-left">
          জামিয়া হুসাইনিয়া মাদ্রাসায় আপনাকে স্বাগতম
        </h1>
        <p className="text-lg sm:text-xl md:text-2xl text-gray-700 leading-relaxed text-center sm:text-left">
          জামিয়া হুসাইনিয়া শায়েস্তাগঞ্জ, হবিগঞ্জ জেলার ঐতিহ্যবাহী ও প্রসিদ্ধ
          দ্বীনি শিক্ষা প্রতিষ্ঠানগুলোর অন্যতম। শায়েস্তাগঞ্জ সংলগ্ন লস্করপুর
          একসময় তরফ রাজ্যের রাজধানী ছিল। বর্তমানেও শায়েস্তাগঞ্জ রেলপথ ও সড়কপথে
          সিলেট বিভাগের অন্যতম প্রবেশদ্বার। এত গুরুত্বপূর্ণ এলাকা হওয়া সত্ত্বেও
          আশির দশক পর্যন্ত বিশাল এ অঞ্চলে কোনো কওমী মাদরাসা ছিল না। মুসলিম
          জনগোষ্ঠীর দ্বীনি ইলমের প্রয়োজনীয়তা বিবেচনা করে এ অঞ্চলের বিশিষ্ট
          বুযুর্গ শায়েখ সৈয়দ আহমদ (চাঁন মিয়া) রহ. তাঁর কয়েকজন ঘনিষ্ঠ বন্ধুর
          পরামর্শে নিজের জমি ওয়াক্‌ফ করে একটি মাদরাসা প্রতিষ্ঠা করেন। আওলাদে
          রাসূল (সা.) শায়খুল ইসলাম আল্লামা সাইয়্যেদ হুসাইন আহমদ মাদানী রহ. এর
          নামানুসারে মাদরাসার নামকরণ করেন ‘জামিয়া হুসাইনিয়া শায়েস্তাগঞ্জ’।
        </p>
      </div>
    </section>
  );
};

export default HomeIntro;
