import React from "react";

const HomeIntro = () => {
  return (
    <section className="max-w-4xl mx-auto p-6">
    <ul className="mb-6">
      <li className="flex items-center gap-2">
        <span className="text-xl">👉</span>
        সপ্তাহে ৬ দিন ক্লাস হয় সকাল ৯ টা থেকে দুপুর ১.৩০ মিনিট পর্যন্ত। শুক্রবারে মাদ্রাসার ক্লাস বন্ধ থাকে।
      </li>
    </ul>
    <div className="max-w-4xl mx-auto w-full p-6 shadow-2xl rounded-lg hover:shadow-2xl transition duration-300 cursor-pointer hover:border-b-2 hover:border-white">
      <h1 className="text-2xl font-semibold mb-6 text-center sm:text-left">
        🏫 জামিয়া হুসাইনিয়া মাদ্রাসা, শায়েস্তাগঞ্জ, হবিগঞ্জ
      </h1>
      <p className="sm:text-xl md:text-lg leading-relaxed text-center sm:text-left">
        📖 জামিয়া হুসাইনিয়া শায়েস্তাগঞ্জ, হবিগঞ্জ জেলার ঐতিহ্যবাহী ও প্রসিদ্ধ
        দ্বীনি শিক্ষা প্রতিষ্ঠানগুলোর অন্যতম। শায়েস্তাগঞ্জ সংলগ্ন লস্করপুর
        একসময় তরফ রাজ্যের রাজধানী ছিল। বর্তমানেও শায়েস্তাগঞ্জ রেলপথ ও সড়কপথে
        সিলেট বিভাগের অন্যতম প্রবেশদ্বার। এত গুরুত্বপূর্ণ এলাকা হওয়া সত্ত্বেও
        আশির দশক পর্যন্ত বিশাল এ অঞ্চলে কোনো কওমী মাদরাসা ছিল না। মুসলিম
        জনগোষ্ঠীর দ্বীনি ইলমের প্রয়োজনীয়তা বিবেচনা করে এ অঞ্চলের বিশিষ্ট
        বুযুর্গ শায়েখ সৈয়দ আহমদ (চাঁন মিয়া) রহ. তাঁর কয়েকজন ঘনিষ্ঠ বন্ধুর
        পরামর্শে নিজের জমি ওয়াক্‌ফ করে একটি মাদরাসা প্রতিষ্ঠা করেন। 🕌 আওলাদে
        রাসূল (সা.) শায়খুল ইসলাম আল্লামা সাইয়্যেদ হুসাইন আহমদ মাদানী রহ. এর
        নামানুসারে মাদরাসার নামকরণ করেন ‘জামিয়া হুসাইনিয়া শায়েস্তাগঞ্জ’।
      </p>
    </div>
  </section>
  );
};

export default HomeIntro;